# --- CLI ---
brew "git"
brew "neovim"
brew "zellij"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "eza"
brew "bat"
brew "jq"
brew "btop"
brew "fastfetch"
brew "zoxide"
brew "awscli"
brew "mise"
brew "lazygit"
brew "lazydocker"
brew "ollama"
brew "stow"
brew "vips"

# AI CLIs
brew "gemini-cli"
tap "sst/tap"
brew "sst/tap/opencode"

# --- Terminal ---
cask "alacritty"
# Fonts for icons in terminal/statuslines
cask "font-hack-nerd-font"
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-dm-sans"
cask "font-fira-code"
cask "font-hack"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-geist-mono"

# --- Apps you listed ---
cask "1password"
cask "visual-studio-code"
cask "brave-browser"
cask "whatsapp"
cask "zoom"
cask "steam"
cask "heroic"         # Epic Games via Heroic Launcher
cask "orbstack"
cask "obsidian"
cask "localsend"
cask "raycast"
cask "microsoft-teams"
cask "typora"
cask "pearcleaner"
cask "chatgpt"
cask "claude"